Repository: Samyocord/BluescreenSimulator
Catalog: BluescreenSimulator/Properties/Strings.*.resx
Languages: de

source: Background color
de: Hintergrundfarbe

source: Cancel
de: Abbrechen

source: Command after complete
de: Befehl nach Fertigstellung

source: Error
de: Fehler

source: Error code
de: Fehlercode

# exe_creator_command
source: Used command:
de: Genutzter Befehl:

# exe_creator_filename
source: File name:
de: Dateiname:

# foreground_color
source: Foreground color (text)
de: Vordergrundfarbe (Text)

source: Generate EXE/Cmd
de: EXE/Befehl generieren

# give_error
source: Give me an error
de: Gib mir einen Fehler

# header_text
source: A problem has been detected and windows has been shutdown to prevent damage to your computer.
de: Auf dem PC ist ein Problem aufgetreten und Windows wurde heruntergefahren um weitere Fehler

# hide_qr
source: Hide QR code completely
de: QR Code verstecken

# information_l1
source: Information (Line 1)
de: Information (Zeile 1)

# information_l2
source: Information (Line 2)
de: Information (Zeile 2)

source: Instructions
de: Anleitung

# instructions_dialog_mit
source: MIT License
de: MIT Lizenz

# instructions_dialog_project
source: Project page
de: Projektseite

# instructions_dialog_t1
source: This program simulates a BSOD without any danger or harm for your PC.
de: Dieses Programm simuliert einen BSOD ohne irgendwelche Gefahren und Schäden an deinem PC.

# instructions_dialog_t10
source: This software is using the MIT-licensed library 'NDesk.Options'. |
de: Diese Software verwendet die MIT-lizenzierte Bibliothek 'NDesk.Options'. |

# instructions_dialog_t11
source: This software is using the MIT-licensed library 'QRCoder'. |
de: Diese Software verwendet die MIT-lizenzierte Bibliothek 'QRCoder'. |

# instructions_dialog_t2
source: Instructions:
de: Anleitung:

# instructions_dialog_t3
source: • You can use the first fields (up to "Background color") to change the text on the BSOD. • In the "Background/Foreground color" fields you can set a background/foreground (text) color (RGB format). • With "Delay", you can set a BSOD to trigger after a specified amount of seconds. • QR code is transparent by default. You can choose to hide it (for Windows 8/8.1 style) or use the original-colored one. • Click "Give me an error" to trigger the BSOD. • To leave the BSOD screen, press Alt + F4 or F7. • If you have specified a delay, you can cancel it by clicking "Cancel BSOD". • Leaving fields empty will set them to default values, which are set to replicate a Windows 9x/7/10 BSOD. • Delay defaults to 0 and command defaults to "no command". • The progress counter advances automatically. • A command line interface exists. Run BluescreenSimulator --help for more info.
de: • Du kannst die ersten Felder (bis zu "Hintergrundfarbe") verwenden um den BSOD Text zu ändern. • In den "Hintergrund/Vordergrundfarbe" Feldern kannst du eine Hintergrund/Vordergrundfarbe festlegen. (RGB Format) • Mit "Verzögerung" kannst du den BSOD erst nach einer bestimmten Anzahl an Sekunden erscheinen lassen. • Der QR Code ist standardmäßig transparent. Du kannst ihn verstecken (Windows 8/8.1 Stil) oder den originalfarbenden verwenden. • Klicke auf "Gib mir einen Fehler" um den BSOD erscheinen zu lassen. • Um den BSOD-Bildschirm zu schließen, drücke Alt + F4 oder F7. • Wenn du eine Verzögerung eingestellt hast, kannst du diese abbrechen mit "BSOD abbrechen" • Wenn du die Felder leer lässt, werden diese auf die Standardeinstellungen gesetzt, welche einen Windows 9x/7/10 BSOD nachahmen. • Die Verzögerung steht standardmäßig auf 0 und der Befehl steht standardmäßig auf "Kein Befehl" • Der Fortschrittszähler wird automatisch größer. • Ein Befehlszeileninterface existiert. Führe BluescreenSimulator --help aus für mehr Informationen

# instructions_dialog_t5
source: In Unsafe Mode, you can specify a CMD command which will be run after the BSOD "completes" (e.g. a reboot command). Because this is potentially dangerous, you have to explicitly enable this by running the program from the command line with the argument "--enable-unsafe", like this: BluescreenSimulator --enable-unsafe
de: Im unsicheren Modus kannst du einen CMD-Befehl einstellen, welcher nach den "fertigstellen" des BSODs ausgeführt wird. (z.B. ein Neustartbefehl) Weil dies möglicherweise gefährlich ist, musst du das Programm explizit mit dem Argument "--enable-unsafe" in der Kommandozeile starten, wie hier: BluescreenSimulator --enable-unsafe

# instructions_dialog_t6
source: Bluescreen Simulator is open source!
de: Bluescreen Simulator ist quelloffen!

# instructions_dialog_t7
source: Check out our Github repository
de: Besuche unser GitHub-Repository

# instructions_dialog_t8
source: I would be glad if you could subscribe to my channel!
de: Es würde mich freuen wenn du meinen Kanal abonnierst

# instructions_dialog_t9
source: FlyTech Videos – YouTube Channel
de: FlyTech Videos – YouTube -Kanal

# main_text_l1
source: Main Text (Line 1)
de: Haupttext (Zeile 1)

# main_text_l1_text
source: Your PC ran into a problem and needs to restart. We're just
de: Auf dem PC ist ein Problem aufgetreten. Er muss neu

# main_text_l2
source: Main Text (Line 2)
de: Haupttext (Zeile 2)

# main_text_l2_text
source: collecting some error info, and then we'll restart for you.
de: gestartet werden. Es werden einige Fehlerinformationen gesammelt, und dann wird ein Neustart ausgeführt.

source: More Info
de: Mehr Info

# more_info_text
source: For more information about this issue and possible fixes, visit https://www.windows.com/stopcode
de: Weitere Informationen zu diesem Problem und mögliche Lösungen finden Sie unter: https://www.windows.com/stopcode

# pick_color
source: Pick a color...
de: Farbe auswählen...

source: Progress indicator
de: Fortschrittsanzeige

# progress_indicator_text
source: complete
de: abgeschlossen

source: Rainbow
de: Regenbogen

# reset
source: Reset fields
de: Felder zurücksetzen

source: Stop code
de: Fehlercode

# stop_code_text
source: Stop code: DRIVER_IRQL_NOT_LESS_OR_EQUAL
de: Stillstandcode: DRIVER_IRQL_NOT_LESS_OR_EQUAL

# support_person_text
source: If you call a support person, give them this info:
de: Halten Sie folgende Infos bereit, wenn Sie den Support anrufen:

# use_orig_blue_qr
source: Use original blue QR code
de: Originalen blauen QR Code verwenden

source: Windows 10 Style
de: Windows 10 Stil

source: Windows 7 Style
de: Windows 7 Stil

source: Windows 9x Style
de: Windows 9x Stil
